<img src="https://raw.githubusercontent.com/paular143/images_notebooks/master/logo-sin-nombre.png" alt="Universidad de Los Andes" style="width: 90px;" align="left" frameborder="300"/>

**UNIVERSIDAD DE LOS ANDES** <br>
**FACULTAD DE ECONOMÍA** <br>
**TÓPICOS EN APRENDIZAJE DE MÁQUINAS** <br>
**PROFESOR COMPLEMENTARIO:** Nicolás Rugeles <br><br>

Objetivo: Explorar el módulo de pandas

In [3]:
import numpy as np
import pandas as pd

In [4]:
#pip install pandas

## Crear un dataframe

Generar una matriz 5x6 con valores aleatorios

In [5]:
mtx= np.random.randint(1,10,size=(5,6))

In [6]:
mtx

array([[2, 6, 3, 3, 3, 2],
       [6, 9, 6, 2, 5, 7],
       [3, 7, 7, 4, 3, 4],
       [7, 8, 2, 6, 4, 2],
       [5, 5, 1, 5, 5, 8]])

In [7]:
pd.DataFrame(mtx)

   0  1  2  3  4  5
0  2  6  3  3  3  2
1  6  9  6  2  5  7
2  3  7  7  4  3  4
3  7  8  2  6  4  2
4  5  5  1  5  5  8

Crear un Dataframe a partir de un diccionario

In [25]:
nombres=['Laura', 'Carlos', 'Julian', 'Juan']
sexo=['F', 'M', 'M', None]
edad=[24,21,25, 30]
notas=[4.5, 2, 3.25, 4]
print(type(nombres))

<class 'list'>

In [26]:
diccionario={'names':nombres, 'sex':sexo, 'age':edad, 'grades':notas}

In [27]:
diccionario

{'names': ['Laura', 'Carlos', 'Julian', 'Juan'],
 'sex': ['F', 'M', 'M', None],
 'age': [24, 21, 25, 30],
 'grades': [4.5, 2, 3.25, 4]}

In [28]:
data=pd.DataFrame(diccionario)

In [29]:
data

    names   sex  age  grades
0   Laura     F   24    4.50
1  Carlos     M   21    2.00
2  Julian     M   25    3.25
3    Juan  None   30    4.00

### Métodos principales de un DataFrame
1. _index_
2. _columns_
3. _shape_
4. _size_
5. _data.count()_
6. _values_
7. _T_
8. _dtypes_

In [30]:
data.index # Retorna el índice

RangeIndex(start=0, stop=4, step=1)

In [31]:
print(data.columns) # Columnas
#data.columns=['n','s','a','g']
data

Index(['names', 'sex', 'age', 'grades'], dtype='object')

    names   sex  age  grades
0   Laura     F   24    4.50
1  Carlos     M   21    2.00
2  Julian     M   25    3.25
3    Juan  None   30    4.00

In [32]:
data.shape # Dimensiones

(4, 4)

In [24]:
data.size # Cantidad de datos

16

In [25]:
data.count() # Cantidad de datos no Nulos

names     4
sex       3
age       4
grades    4
dtype: int64

In [26]:
data.count().sum() < data.size

True

In [27]:
data.values # Lo vuelve np.array

array([['Laura', 'F', 24, 4.5],
       ['Carlos', 'M', 21, 2.0],
       ['Julian', 'M', 25, 3.25],
       ['Juan', None, 30, 4.0]], dtype=object)

In [28]:
data.T # Trasponer

            0       1       2     3
names   Laura  Carlos  Julian  Juan
sex         F       M       M  None
age        24      21      25    30
grades    4.5     2.0    3.25   4.0

In [29]:
data.dtypes

names      object
sex        object
age         int64
grades    float64
dtype: object

### Indexación y Filtros
1. Extracción de columnas
2. _set-index()_
3. _query()_
4. _loc_
5. _iloc_
6. _reset-index()_

In [33]:
data['names'] # Extraiga la columna names

0     Laura
1    Carlos
2    Julian
3      Juan
Name: names, dtype: object

In [34]:
data.names # Extraiga la colunma names como método

0     Laura
1    Carlos
2    Julian
3      Juan
Name: names, dtype: object

In [35]:
data.names[1]

'Carlos'

Qué pasa si cambio los índices?

In [36]:
data.index +=1 # Qué pasa si cambio los

In [37]:
data

    names   sex  age  grades
1   Laura     F   24    4.50
2  Carlos     M   21    2.00
3  Julian     M   25    3.25
4    Juan  None   30    4.00

In [38]:
data.reset_index(drop=True, inplace=True)

In [39]:
data

    names   sex  age  grades
0   Laura     F   24    4.50
1  Carlos     M   21    2.00
2  Julian     M   25    3.25
3    Juan  None   30    4.00

In [40]:
data['names']=='Mateo'

0    False
1    False
2    False
3    False
Name: names, dtype: bool

In [41]:
(data['age']>24) & (data['grades']>3.5)

0    False
1    False
2    False
3     True
dtype: bool

In [42]:
(data['age']>24) | (data['grades']>3.5)

0     True
1    False
2     True
3     True
dtype: bool

In [43]:
data

    names   sex  age  grades
0   Laura     F   24    4.50
1  Carlos     M   21    2.00
2  Julian     M   25    3.25
3    Juan  None   30    4.00

In [44]:
data[data['names']=='Mateo'] # Extraiga la columna cuya variable 'names' es igual a Mateo

Empty DataFrame
Columns: [names, sex, age, grades]
Index: []

In [45]:
data[data['names']=='Laura'] # Extraiga la columna cuya variable 'names' es igual a Mateo

   names sex  age  grades
0  Laura   F   24     4.5

In [46]:
data[(data['age']>24) | (data['grades']>3.5)] # Extraiga la columna cuya variable 'names' es igual a Mateo

    names   sex  age  grades
0   Laura     F   24    4.50
2  Julian     M   25    3.25
3    Juan  None   30    4.00

In [47]:
data.set_index('names', inplace=True) # Ponga la columna names como índice
data

         sex  age  grades
names
Laura      F   24    4.50
Carlos     M   21    2.00
Julian     M   25    3.25
Juan    None   30    4.00

In [48]:
data

         sex  age  grades
names
Laura      F   24    4.50
Carlos     M   21    2.00
Julian     M   25    3.25
Juan    None   30    4.00

In [49]:
print(data.loc['Laura']) # Extraiga la fila de Laura usando .loc
print(data.loc[:,'age']) # Extraiga la columna de edad usando .loc
print(data.loc[['Juan', 'Carlos'], 'grades']) # Extraiga las notas de Juan y Carlos usando .loc
data.loc[(data['age'] > 20) & (data['sex'] == 'F')]

sex         F
age        24
grades    4.5
Name: Laura, dtype: object
names
Laura     24
Carlos    21
Julian    25
Juan      30
Name: age, dtype: int64
names
Juan      4.0
Carlos    2.0
Name: grades, dtype: float64

      sex  age  grades
names
Laura   F   24     4.5

In [50]:
df=data.query('age>23')
df

         sex  age  grades
names
Laura      F   24    4.50
Julian     M   25    3.25
Juan    None   30    4.00

In [51]:
nombre='Julian'

In [52]:
df=data.query('names==@nombre')
df=data.query(f'names=="{nombre}"')

df

       sex  age  grades
names
Julian   M   25    3.25

In [53]:
df.age*=2
df

C:\Users\arias\AppData\Local\Temp\ipykernel_8188\717145624.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.age*=2

       sex  age  grades
names
Julian   M   50    3.25

In [54]:
data

         sex  age  grades
names
Laura      F   24    4.50
Carlos     M   21    2.00
Julian     M   25    3.25
Juan    None   30    4.00

In [55]:
df._is_view

False

In [56]:
df._is_copy

In [57]:
data.loc['Julian','age']*=2

In [58]:
df_test=data.loc[['Carlos']]['age']
print(df_test._is_view)
print(df_test._is_copy)
df_test['age'] = 20
print(df_test._is_view)
print(df_test._is_copy)

True
None
False
None

In [59]:
data

         sex  age  grades
names
Laura      F   24    4.50
Carlos     M   21    2.00
Julian     M   50    3.25
Juan    None   30    4.00

In [60]:
data.iloc[::2,::2]
data.iloc[[0,2],[0,2]]

       sex  grades
names
Laura    F    4.50
Julian   M    3.25

In [61]:
data.iloc[[0,2],[1]]*=3

In [62]:
data

         sex  age  grades
names
Laura      F   72    4.50
Carlos     M   21    2.00
Julian     M  150    3.25
Juan    None   30    4.00

In [63]:
df2=data.iloc[[0,2],[1]]
df2/=3

In [64]:
df2

         age
names
Laura   24.0
Julian  50.0

In [65]:
data

         sex  age  grades
names
Laura      F   72    4.50
Carlos     M   21    2.00
Julian     M  150    3.25
Juan    None   30    4.00

In [66]:
data.loc['Juan','age']=34

In [67]:
data

         sex  age  grades
names
Laura      F   72    4.50
Carlos     M   21    2.00
Julian     M  150    3.25
Juan    None   34    4.00

## Crear nuevas columnas

### Edición de columnas
1. ¿Qué tipo de objeto es una columna?
2. Súmele a la edad 2 años (no guarde el valor, solo imprímalo).
3. Cree una nueva columna, que se llame 'mi_nueva_variable' que sea el número 1 en todas las filas. 
4. Reescale las notas de 0 a 100 en una nueva columna.

In [68]:
type(data.grades)

pandas.core.series.Series

In [69]:
data.age+2 # También vea como usar .add(), .sub(), .mul() y .div()

names
Laura      74
Carlos     23
Julian    152
Juan       36
Name: age, dtype: int64

In [70]:
data.age+=2

In [71]:
data['mi_nueva_variable']=1
data

         sex  age  grades  mi_nueva_variable
names
Laura      F   74    4.50                  1
Carlos     M   23    2.00                  1
Julian     M  152    3.25                  1
Juan    None   36    4.00                  1

In [72]:
data['rescaled_grades']=data.grades*100/5
data

         sex  age  grades  mi_nueva_variable  rescaled_grades
names
Laura      F   74    4.50                  1             90.0
Carlos     M   23    2.00                  1             40.0
Julian     M  152    3.25                  1             65.0
Juan    None   36    4.00                  1             80.0

### Estadísticas descriptivas
1. _sum()_
1. _min()_
1. _max()_
1. _idxmin()_
1. _idxmax()_
1. _describe()_
1. _mean()_
1. _median()_

Revise axis=0 y axis=1

In [73]:
data.dtypes

sex                   object
age                    int64
grades               float64
mi_nueva_variable      int64
rescaled_grades      float64
dtype: object

In [74]:
data= data.iloc[:,1:]

In [75]:
data

        age  grades  mi_nueva_variable  rescaled_grades
names
Laura    74    4.50                  1             90.0
Carlos   23    2.00                  1             40.0
Julian  152    3.25                  1             65.0
Juan     36    4.00                  1             80.0

In [76]:
data[data['age'].isin([23,77])]

        age  grades  mi_nueva_variable  rescaled_grades
names
Carlos   23     2.0                  1             40.0

In [77]:
data.sum()

age                  285.00
grades                13.75
mi_nueva_variable      4.00
rescaled_grades      275.00
dtype: float64

In [78]:
data.min()

age                  23.0
grades                2.0
mi_nueva_variable     1.0
rescaled_grades      40.0
dtype: float64

In [79]:
data.max()

age                  152.0
grades                 4.5
mi_nueva_variable      1.0
rescaled_grades       90.0
dtype: float64

In [80]:
data.age.idxmin()

'Carlos'

In [81]:
data.rescaled_grades.idxmax()

'Laura'

In [82]:
data.describe()

              age    grades  mi_nueva_variable  rescaled_grades
count    4.000000  4.000000                4.0         4.000000
mean    71.250000  3.437500                1.0        68.750000
std     58.019393  1.087332                0.0        21.746647
min     23.000000  2.000000                1.0        40.000000
25%     32.750000  2.937500                1.0        58.750000
50%     55.000000  3.625000                1.0        72.500000
75%     93.500000  4.125000                1.0        82.500000
max    152.000000  4.500000                1.0        90.000000

In [83]:
data.dtypes

age                    int64
grades               float64
mi_nueva_variable      int64
rescaled_grades      float64
dtype: object

In [84]:
data.mean()

age                  71.2500
grades                3.4375
mi_nueva_variable     1.0000
rescaled_grades      68.7500
dtype: float64

In [85]:
data.median()

age                  55.000
grades                3.625
mi_nueva_variable     1.000
rescaled_grades      72.500
dtype: float64

### Aplicar Funciones
Es necesario comprender qué es  _lambda_ y usar _.apply_

In [86]:
data

        age  grades  mi_nueva_variable  rescaled_grades
names
Laura    74    4.50                  1             90.0
Carlos   23    2.00                  1             40.0
Julian  152    3.25                  1             65.0
Juan     36    4.00                  1             80.0

In [87]:
data.apply(lambda x: x*2)

        age  grades  mi_nueva_variable  rescaled_grades
names
Laura   148     9.0                  2            180.0
Carlos   46     4.0                  2             80.0
Julian  304     6.5                  2            130.0
Juan     72     8.0                  2            160.0

In [88]:
data["age"]=data["age"].apply(lambda x: x+2)

In [89]:
data

        age  grades  mi_nueva_variable  rescaled_grades
names
Laura    76    4.50                  1             90.0
Carlos   25    2.00                  1             40.0
Julian  154    3.25                  1             65.0
Juan     38    4.00                  1             80.0

# Borrar Filas y Columnas
1. _drop()_
2. _drop-na()_

In [90]:
data.drop('Carlos',inplace=True) # Borre la fila identificada como 1

In [91]:
data

        age  grades  mi_nueva_variable  rescaled_grades
names
Laura    76    4.50                  1             90.0
Julian  154    3.25                  1             65.0
Juan     38    4.00                  1             80.0

In [92]:
data.drop(columns=['grades']) # Borre la columna de grades

        age  mi_nueva_variable  rescaled_grades
names
Laura    76                  1             90.0
Julian  154                  1             65.0
Juan     38                  1             80.0

In [93]:
data.dropna() # Borre las filas con valores faltantes

        age  grades  mi_nueva_variable  rescaled_grades
names
Laura    76    4.50                  1             90.0
Julian  154    3.25                  1             65.0
Juan     38    4.00                  1             80.0